CSI API ETABS v1
cSelect.InvertSelection Method
 Deselects all selected objects and selects all unselected objects; that is, it inverts the selection
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int InvertSelection()
Function InvertSelection As Integer
Dim instance As cSelect
Dim returnValue As Integer
returnValue = instance.InvertSelection()
int InvertSelection()
abstract InvertSelection : unit -> int
Return Value
Type: Int32
 Returns zero if the selection is successfully inverted, otherwise it returns nonzero
Remarks
See Also
Reference
cSelect Interface
ETABSv1 Namespace